<?php 
    session_start();

    if (!isset($_SESSION['username'])) {
        $_SESSION['msg'] = "You must log in first";
        header('location: login.php');
    }

    if (isset($_GET['logout'])) {
        session_destroy();
        unset($_SESSION['username']);
        header('location: login.php');
    }

?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Home Page</title>

    <link rel="stylesheet" href="style.css">
</head>
<body>
    
    <div class="homeheader">
        <img src="Untitled-1.jpg"/>
    </div>
    <div id="menu" style="background-color:#01a6ba;height:780px;width:200px;float:left;">
</b><br>
<a href='index.php'>
     <img border = '0' src='Untitled-2.jpg'>
    </a>
<a href='page1.php'>
     <img border = '0' src='Untitled-3.jpg'>
    </a>
<a href='page2.php'>
     <img border = '0' src='Untitled-4.jpg'>
    </a>
<a href='page3.php'>
     <img border = '0' src='Untitled-5.jpg'>
    </a>
<a href='page4.php'>
     <img border = '0' src='Untitled-6.jpg'>
    </a>
<a href='page5.php'>
     <img border = '0' src='Untitled-7.jpg'>
    </a>
<a href='page6.php'>
     <img border = '0' src='Untitled-8.jpg'>
    </a>
</div>
<div id="content" style="background-color:pink;height:1300px;width:1148px;float:left;">
<pre>Photoshop เป็นโปรแกรมชื่อดังที่เอาไว้ตกแต่งภาพ
หลายคนคงรู้จักกับโปรแกรม Photoshop ถึงแม้จะไม่ได้เป็นนักออกแบบก็ตาม
เจ้าของโปรแกรม Photoshop ชื่อบริษัท Adobe Systems
แล้วทำไม Adobe Systems ถึงเป็นสุดยอดเสือนอนกิน
ลงทุนแมนจะเล่าให้ฟัง
ในปี 1988 Photoshop ถูกพัฒนาขึ้นมาโดยสองพี่น้อง Thomas and John Knoll โดยมีชื่อเดิมว่า Image Pro และต่อมาถูกซื้อโดย บริษัท Adobe Systems ในปีเดียวกัน
สำหรับบริษัท Adobe Systems เริ่มต้นขึ้นในปี 1982 โดย John Warnock and Charles Geschke ซึ่งทั้งคู่นี้เคยทำงานอยู่ในบริษัท Xerox มาก่อน
ต่อมาโปรแกรม Image Pro ได้ถูกเปลี่ยนชื่อมาเป็น Photoshop ในปี 1989 และได้ขายครั้งแรกอย่างเป็นทางการในปี 1990
ช่วงแรกโปรแกรมของค่าย Adobe จะมีให้ใช้เฉพาะบน Apple Computer เท่านั้น ผ่านไปอีก 2 ปี ถึงมีเวอร์ชันสำหรับ Windows ออกมาให้ใช้
ถ้านับตั้งแต่เริ่มต้นจนถึงปัจจุบัน Photoshop มีอายุ 30 ปี และมีมาแล้วถึง 26 เวอร์ชัน
โปรแกรมของค่าย Adobe ส่วนใหญ่จะเกี่ยวข้องกับงานกราฟฟิกทุกรูปแบบ

หลักๆ ที่คนทั่วไปรู้จักก็คงจะเป็น
Adobe Photoshop - ใช้สำหรับตกแต่งภาพ / รีทัชภาพ
Adobe Illustrator - ใช้สำหรับการวาดภาพ / สร้างภาพที่เป็น Vector (ไฟล์ที่มีความคมชัดสูง)
Adobe After Effects - สำหรับภาพเคลื่อนไหว วิดีโอโมชั่นกราฟฟิก
Adobe Premiere - สำหรับงานตัดต่อวิดีโอ
Adobe Lightroom - สำหรับตกแต่งภาพถ่าย
Adobe InDesign - สำหรับสร้างงานสื่อสิ่งพิมพ์ / จัดหน้าหนังสือ / นิตยสาร
และยังมีหลายโปรแกรมเฉพาะทางอีกมากมาย ไม่ว่าจะเป็น
Adobe Xd สำหรับออกแบบ User Interface ให้ Application
Adobe Dreamweaver ออกแบบเว็บไซต์
Adobe Audition สำหรับเรื่องเสียง
ที่กล่าวมาทั้งหมดนี้เฉพาะบน Platform Computer เท่านั้น
ยังไม่รวม Application ที่พัฒนาให้ใช้บนมือถือ ซึ่งรวมทั้งหมดแล้วเกือบ 100 โปรแกรม
Adobe ได้ซื้อธุรกิจที่ใกล้เคียงกันโดย ในปี 2012 Adobe ได้ซื้อเว็บไซต์ Behance เว็บไซต์ Community อันดับหนึ่งของนักออกแบบมาเป็นส่วนหนึ่งของกิจการ ในราคา 150 ล้านเหรียญ
และนอกจากนี้ยังมี Stock Photo เป็นของตัวเอง ภายใต้ชื่อ Adobe Stock รวมไปถึงมีระบบอีกมากมายที่สร้างมาเพื่อรองรับการทำงานของนักออกแบบโดยเฉพาะ
รายได้หลักของ Adobe จะมาจากการขายลิขสิทธิ์โปรแกรมแบบขายขาดตาม Version และขายแยกเป็นรายโปรแกรมไป
จนกระทั่งปี 2003 เริ่มมีการขายแบบเป็นเซ็ท ในชื่อ Creative Suite ซึ่งจะรวมหลายๆโปรแกรมเข้าไว้ด้วยกัน และขายเป็นเซ็ทในราคาที่ถูกกว่าเดิม
แต่ Adobe ก็ยังเจอกับปัญหาการใช้ซอฟต์แวร์แบบละเมิดลิขสิทธิ์มาตลอด เพราะ ราคาของตัวโปรแกรมสูงเกินกว่าผู้ใช้ทั่วไปจะสามารถซื้อได้
แต่ในที่สุดจุดเปลี่ยนของบริษัท Adobe ก็มาถึง
ปี 2013 Adobe ปรับรูปแบบในการขายใหม่เป็นรูปการให้เช่ารายเดือนแทน ทำให้รายได้ของ Adobe เพิ่มขึ้นอย่างต่อเนื่อง และราคาหุ้นเพิ่มขึ้นหลายเท่าหลังจากนั้น

และเรื่องนี้ยังสามารถแก้ปัญหาการละเมิดลิขสิทธิ์ได้เป็นอย่างดี เพราะ ราคาที่ต้องจ่ายในการเช่าโปรแกรมมีราคาถูกลง และ โปรแกรมเวอร์ชันเก่า หรือโปรแกรมผิดลิขสิทธิ์นั้นไม่สามารถใช้งานร่วมกับเวอร์ชันปัจจุบันได้
ถ้าบอกตัวเลขแล้วคงต้องตกใจ
เพราะว่าปัจจุบันมีผู้ใช้งาน 12 ล้านคนทั่วโลกที่เสียค่าบริการให้ Adobe
และ Adobe มีส่วนแบ่งของตลาดโปรแกรม Creative มากถึง 47 %
และโปรแกรมที่นิยมสุดของ Adobe ก็คงหนีไม่พ้น Photoshop ที่มีส่วนแบ่งถึง 87% ของตลาดโปรแกรมแต่งภาพ ซึ่งเรียกได้ว่าน่าจะครองตลาดนี้ไปเรียบร้อยแล้ว
ตัวเลขนี้นับเฉพาะผู้ใช้งานดาวน์โหลดแบบถูกลิขสิทธิ์เท่านั้น ยังไม่นับถึงผู้ใช้แบบผิดลิขสิทธิ์ที่ก็ยังมีใช้กันอยู่มากในบางประเทศ
รายได้ของ Adobe
ปี 2015 รายได้ 150,000 ล้านบาท กำไรสุทธิ 20,000 ล้านบาท
ปี 2016 รายได้ 184,000 ล้านบาท กำไรสุทธิ 37,000 ล้านบาท
ปี 2017 รายได้ 229,000 ล้านบาท กำไรสุทธิ 53,000 ล้านบาท
ก่อนเห็นตัวเลขนี้หลายคนคงคิดว่าบริษัทนี้คงอิ่มตัวแล้ว แต่เมื่อเจอกับสิ่งที่เกิดขึ้นก็คงต้องบอกว่านี่เป็นบริษัทที่ยังเติบโตอยู่ และเติบโตแบบก้าวกระโดดเสียด้วย
ซึ่งนักลงทุนในตลาดหุ้นสหรัฐก็คงคิดเช่นนั้น ถึงยอมให้ PE ของหุ้นบริษัทนี้มากถึง 63 เท่า
ตอนนี้บริษัท Adobe Systems มีมูลค่า 3.2 ล้านล้านบาท ใหญ่กว่าทุกบริษัทที่จดทะเบียนในตลาดหลักทรัพย์แห่งประเทศไทย
ใครจะไปคิดว่าโปรแกรมตกแต่งรูป จะมีมูลค่ามากกว่า ปตท. ท่าอากาศยานไทย และ ธนาคารทุกธนาคารในประเทศไทย
เรื่อง Adobe ทำให้เราได้รู้ว่า ธุรกิจของตลาดโปรแกรม และ ซอฟต์แวร์ มีมูลค่ามหาศาล
จากการเริ่มต้นธุรกิจของคนไม่กี่คน จนถึงปัจจุบันนี้ Adobe ได้ก้าวมาเป็นผู้นำในตลาดซอฟต์แวร์สำหรับงานออกแบบกราฟฟิก
และก็ไม่น่าจะมีคู่แข่งรายไหนมาแทนที่ได้ในเวลาอันใกล้นี้ แม้จะมีโปรแกรมที่มีการใช้งานใกล้เคียงกันมาเป็นตัวเลือก เพราะนักออกแบบเกือบทุกคนก็ยังคงคุ้นเคยและเลือกใช้ Adobe มากกว่าอยู่ดี
การทำให้นักออกแบบซึ่งเป็นผู้ซื้อสินค้าคุ้นชินกับสินค้า กลับเป็นเกราะป้องกันไม่ให้มีคู่แข่งรายใหม่เข้ามาโดยไม่รู้ตัว
และการปรับเปลี่ยนการขายขาด เป็นแบบเช่ารายเดือน ของ Adobe ก็เป็นกลยุทธ์ที่น่าสนใจ เพราะจากเดิมที่คอยต้องลุ้นว่าโปรแกรมเวอร์ชันใหม่จะขายได้หรือไม่ มาถึงตอนนี้ก็ไม่ต้องลุ้นอีกต่อไป
ทุกๆ เดือน Adobe จะได้รับค่าเช่าจากคนใช้ ไม่ต่างอะไรจาก การมีหอพักขนาดใหญ่ที่มีคนมาขอเช่าตลอดเวลา
ปิดท้ายด้วยตัวเลขที่น่าสนใจ
ถ้าเรามีธุรกิจที่ขายสินค้าราคา 100 บาท คิดว่าต้นทุนสินค้าของเราควรจะเป็นเท่าไร
บางคนบอกว่าต้นทุนควรจะประมาณ 70 บาท บางคนบอกว่า 50 บาท
แต่สำหรับบริษัท Adobe ขอบอกว่า เขามีต้นทุนสินค้าเพียง 14 บาท</pre>

</div>

    <div class="homecontent">
        <!--  notification message -->
        <?php if (isset($_SESSION['success'])) : ?>
            <div class="success">
                <h3>
                    <?php 
                        echo $_SESSION['success'];
                        unset($_SESSION['success']);
                    ?>
                </h3>
            </div>
        <?php endif ?>
    
        <!-- logged in user information -->
        <?php if (isset($_SESSION['username'])) : ?>
            <p>Welcome <strong><?php echo $_SESSION['username']; ?></strong></p>
            <p><a href="index.php?logout='1'" style="color: red;">Logout</a></p>
        <?php endif ?>
    </div>

</body>
</html>